results/springboot/r6gd.xlarge/wrk4.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: r6gd.xlarge
Spring Boot Host: springboot-server-r6gd-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-r6gd-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.89ms    0.88ms  35.03ms   88.69%
    Req/Sec    13.59k   678.40    15.62k    68.33%
  Latency Distribution
     50%    1.79ms
     75%    2.03ms
     90%    2.61ms
     99%    4.53ms
  1622238 requests in 1.00m, 216.89MB read
Requests/sec:  27037.09
Transfer/sec:      3.61MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-r6gd-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.42ms    1.28ms  66.76ms   81.62%
    Req/Sec    14.76k   827.52    16.93k    67.00%
  Latency Distribution
     50%    3.29ms
     75%    3.85ms
     90%    4.74ms
     99%    6.73ms
  1762628 requests in 1.00m, 235.65MB read
Requests/sec:  29357.25
Transfer/sec:      3.92MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-r6gd-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.35ms    2.28ms 223.86ms   81.18%
    Req/Sec    15.91k     0.86k   18.19k    67.22%
  Latency Distribution
     50%    6.12ms
     75%    7.16ms
     90%    8.64ms
     99%   12.19ms
  946629 requests in 30.02s, 126.56MB read
Requests/sec:  31536.74
Transfer/sec:      4.22MB

===== Spring Boot Benchmark Complete =====